# Brewfile - Homebrew bundle manifest
# Updated by export.sh / sync.sh from the current machine state

# Taps
tap "nikitabobko/tap"

# =============================================================================
# Core CLI Tools
# =============================================================================
brew "fish"
brew "starship"
brew "neovim"
brew "git"
brew "git-lfs"
brew "gh"
brew "lazygit"
brew "btop"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "jq"
brew "tree"
brew "curl"
brew "coreutils"
brew "mise"

# =============================================================================
# AI Tools
# =============================================================================
brew "opencode"
# Claude Code is installed via curl script in setup.sh
cask "codex"
cask "codex-app"

# =============================================================================
# Terminal & Window Management
# =============================================================================
cask "ghostty@tip"
cask "nikitabobko/tap/aerospace@0.19.2"

# =============================================================================
# Editor & LLM
# =============================================================================
cask "lm-studio"

# =============================================================================
# iOS Development
# =============================================================================
brew "xcodes"
cask "xcodes-app"

# =============================================================================
# Media Processing
# =============================================================================
brew "ffmpeg"

# =============================================================================
# Security
# =============================================================================
brew "gnupg"
brew "pinentry-mac"

# =============================================================================
# Productivity Apps
# =============================================================================
cask "obsidian"
cask "meetingbar"
cask "itsycal"
cask "1password"
cask "raycast"
cask "shottr"
cask "the-unarchiver"

# =============================================================================
# Communication
# =============================================================================
cask "slack"
cask "telegram"

# =============================================================================
# Browser
# =============================================================================
cask "google-chrome"
